In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [15]:
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [16]:
df2 = DataFrame({'key':['a','b','d'], 'data':range(3)})

In [17]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [18]:
df2

   data key
0     0   a
1     1   b
2     2   d

In [19]:
#merging data1 and data2
pd.merge(df1,df2)

   data1 key  data
0      0   b     1
1      1   b     1
2      6   b     1
3      2   a     0
4      4   a     0
5      5   a     0

In [20]:
pd.merge(df1,df2,on='key')

   data1 key  data
0      0   b     1
1      1   b     1
2      6   b     1
3      2   a     0
4      4   a     0
5      5   a     0

In [21]:
df3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [34]:
df4 = DataFrame({'rkey':['a','b','d'], 'data2':range(3)})  #many to one

In [35]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [36]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [37]:
pd.merge(df3,df4,left_on = 'lkey', right_on = 'rkey')  #by default merge is inner join
#inner join is intersection, using only values in both data

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [38]:
pd.merge(df1,df2,how = 'outer')  #outer join is union, showing values both

   data1 key  data
0    0.0   b   1.0
1    1.0   b   1.0
2    6.0   b   1.0
3    2.0   a   0.0
4    4.0   a   0.0
5    5.0   a   0.0
6    3.0   c   NaN
7    NaN   d   2.0

# many to many merge

In [39]:
df1 = DataFrame ({'key': ['b','b','a','c','a','b'], 'data1': range(6) })

In [45]:
df2 = DataFrame ({'key': ['a','b','a','b','d'], 'data2': range(5) })

In [46]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [47]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [48]:
pd.merge(df1,df2, on = 'key', how = 'left')  #mapping from df1 to df2 
#it will take values all the values only in df1 and try to merge with df2 
#its again union so showing all the values

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [49]:
pd.merge(df1,df2,how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [54]:
left = DataFrame ({'key1': ['foo','foo','bar'],
                  'key2': ['one','two','one'],
                  'lval': [1,2,3]})

In [55]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [58]:
right = DataFrame ({'key1': ['foo','foo','bar','bar'],
                  'key2': ['one','one','one','two'],
                  'rval': [4,5,6,7]})

In [59]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [60]:
pd.merge(left,right,on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

# Merging by index

In [61]:
left1 =  DataFrame({'key':['a','b','a','a','b','c'], 
                   'value': range(6)})

In [62]:
right1 = DataFrame({'group_val':[3.5,7]}, 
                   index = ['a','b'])

In [63]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

right1

In [65]:
pd.merge(left1,right1,left_on = 'key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [66]:
import numpy as np

In [67]:
lefth = DataFrame({'key1': ['Seoul', 'Seoul', 'Seoul', 'Busan', 'Busan'],
'key2': [2000, 2001, 2002, 2001, 2002],
'data': np.arange(5.)})

In [68]:
lefth

   data   key1  key2
0   0.0  Seoul  2000
1   1.0  Seoul  2001
2   2.0  Seoul  2002
3   3.0  Busan  2001
4   4.0  Busan  2002

In [69]:
righth = DataFrame(np.arange(12).reshape((6, 2)),
index=[['Gwangju', 'Gwangju', 'Seoul', 'Seoul', 'Seoul',
'Seoul'],
[2001, 2000, 2000, 2000, 2001, 2002]],
columns=['event1', 'event2'])